{"backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "sparse": false, "name": "input"}, "class_name": "InputLayer", "name": "input"}, {"inbound_nodes": [[["input", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_size": [3, 3], "padding": "valid", "filters": 32, "kernel_regularizer": null, "activation": "relu", "name": "conv2d_1", "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "trainable": true}, "class_name": "Conv2D", "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_size": [3, 3], "padding": "valid", "filters": 64, "kernel_regularizer": null, "activation": "relu", "name": "conv2d_2", "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "trainable": true}, "class_name": "Conv2D", "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"dtype": "float32", "batch_input_shape": [null, -1, 14, 14, 64], "target_shape": [12544], "trainable": true, "name": "reshape_1"}, "class_name": "Reshape", "name": "reshape_1"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "config": {"units": 128, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "relu", "name": "dense_1", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense", "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"units": 10, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "activation": "linear", "name": "output", "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense", "name": "output"}], "output_layers": [["output", 0, 0]], "input_layers": [["input", 0, 0]], "name": "model_1"}, "class_name": "Model", "keras_version": "2.2.4"}